### 📖 Terraform Plan (src/core/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_key_vault_access_policy.kv_common_infra_cd will be created
  + resource "azurerm_key_vault_access_policy" "kv_common_infra_cd" {
      + id                 = (known after apply)
      + key_vault_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.KeyVault/vaults/io-p-kv-common"
      + object_id          = "19c9e57c-3b95-4cb4-9408-f596f1cc8f8f"
      + secret_permissions = [
          + "Get",
          + "List",
          + "Set",
          + "Delete",
        ]
      + tenant_id          = "7788edaf-0346-4068-9d79-c868aed15b3d"
    }

  # module.key_vault_itn.azurerm_key_vault.common_itn_01 will be created
  + resource "azurerm_key_vault" "common_itn_01" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = true
      + enabled_for_disk_encryption   = true
      + id                            = (known after apply)
      + location                      = "italynorth"
      + name                          = "io-p-itn-common-kv-01"
      + public_network_access_enabled = true
      + purge_protection_enabled      = true
      + resource_group_name           = "io-p-itn-common-rg-01"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 30
      + tags                          = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
      + tenant_id                     = "7788edaf-0346-4068-9d79-c868aed15b3d"
      + vault_uri                     = (known after apply)

      + contact (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.key_vault_weu.azurerm_key_vault_access_policy.kv_common_io_infra_ci will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "kv_common_io_infra_ci" {
      ~ certificate_permissions = [
          + "Get",
          + "List",
        ]
        id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.KeyVault/vaults/io-p-kv-common/objectId/8d5d04c7-98f7-4f27-91ae-249231d96918"
      ~ key_permissions         = [
          + "Get",
          + "List",
        ]
        # (6 unchanged attributes hidden)
    }

  # module.key_vault_itn.module.iam_kv_admins["100cb2bb-92d5-40ad-bfa9-1d3c676f13e1"].module.key_vault.azurerm_role_assignment.certificates["io-p-itn-common-rg-01|io-p-itn-common-kv-01|owner"] will be created
  + resource "azurerm_role_assignment" "certificates" {
      + description                      = "Allows Admin AD Groups to manage the Key Vault"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "100cb2bb-92d5-40ad-bfa9-1d3c676f13e1"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Certificates Officer"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-common-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_itn.module.iam_kv_admins["100cb2bb-92d5-40ad-bfa9-1d3c676f13e1"].module.key_vault.azurerm_role_assignment.keys["io-p-itn-common-rg-01|io-p-itn-common-kv-01|owner"] will be created
  + resource "azurerm_role_assignment" "keys" {
      + description                      = "Allows Admin AD Groups to manage the Key Vault"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "100cb2bb-92d5-40ad-bfa9-1d3c676f13e1"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Crypto Officer"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-common-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_itn.module.iam_kv_admins["100cb2bb-92d5-40ad-bfa9-1d3c676f13e1"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-common-rg-01|io-p-itn-common-kv-01|owner"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + description                      = "Allows Admin AD Groups to manage the Key Vault"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "100cb2bb-92d5-40ad-bfa9-1d3c676f13e1"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-common-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_itn.module.iam_kv_admins["12a48460-7d95-4d91-ab0a-1d19008aac2c"].module.key_vault.azurerm_role_assignment.certificates["io-p-itn-common-rg-01|io-p-itn-common-kv-01|owner"] will be created
  + resource "azurerm_role_assignment" "certificates" {
      + description                      = "Allows Admin AD Groups to manage the Key Vault"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "12a48460-7d95-4d91-ab0a-1d19008aac2c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Certificates Officer"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-common-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_itn.module.iam_kv_admins["12a48460-7d95-4d91-ab0a-1d19008aac2c"].module.key_vault.azurerm_role_assignment.keys["io-p-itn-common-rg-01|io-p-itn-common-kv-01|owner"] will be created
  + resource "azurerm_role_assignment" "keys" {
      + description                      = "Allows Admin AD Groups to manage the Key Vault"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "12a48460-7d95-4d91-ab0a-1d19008aac2c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Crypto Officer"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-common-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_itn.module.iam_kv_admins["12a48460-7d95-4d91-ab0a-1d19008aac2c"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-common-rg-01|io-p-itn-common-kv-01|owner"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + description                      = "Allows Admin AD Groups to manage the Key Vault"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "12a48460-7d95-4d91-ab0a-1d19008aac2c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-common-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_itn.module.iam_kv_admins["a0ed72be-f9f9-407e-bf25-91761f8d3de7"].module.key_vault.azurerm_role_assignment.certificates["io-p-itn-common-rg-01|io-p-itn-common-kv-01|owner"] will be created
  + resource "azurerm_role_assignment" "certificates" {
      + description                      = "Allows Admin AD Groups to manage the Key Vault"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a0ed72be-f9f9-407e-bf25-91761f8d3de7"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Certificates Officer"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-common-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_itn.module.iam_kv_admins["a0ed72be-f9f9-407e-bf25-91761f8d3de7"].module.key_vault.azurerm_role_assignment.keys["io-p-itn-common-rg-01|io-p-itn-common-kv-01|owner"] will be created
  + resource "azurerm_role_assignment" "keys" {
      + description                      = "Allows Admin AD Groups to manage the Key Vault"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a0ed72be-f9f9-407e-bf25-91761f8d3de7"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Crypto Officer"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-common-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_itn.module.iam_kv_admins["a0ed72be-f9f9-407e-bf25-91761f8d3de7"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-common-rg-01|io-p-itn-common-kv-01|owner"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + description                      = "Allows Admin AD Groups to manage the Key Vault"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a0ed72be-f9f9-407e-bf25-91761f8d3de7"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-common-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_itn.module.iam_kv_admins["d38daf6e-4e65-46d2-a11a-6e016b29fcbc"].module.key_vault.azurerm_role_assignment.certificates["io-p-itn-common-rg-01|io-p-itn-common-kv-01|owner"] will be created
  + resource "azurerm_role_assignment" "certificates" {
      + description                      = "Allows Admin AD Groups to manage the Key Vault"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d38daf6e-4e65-46d2-a11a-6e016b29fcbc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Certificates Officer"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-common-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_itn.module.iam_kv_admins["d38daf6e-4e65-46d2-a11a-6e016b29fcbc"].module.key_vault.azurerm_role_assignment.keys["io-p-itn-common-rg-01|io-p-itn-common-kv-01|owner"] will be created
  + resource "azurerm_role_assignment" "keys" {
      + description                      = "Allows Admin AD Groups to manage the Key Vault"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d38daf6e-4e65-46d2-a11a-6e016b29fcbc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Crypto Officer"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-common-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_itn.module.iam_kv_admins["d38daf6e-4e65-46d2-a11a-6e016b29fcbc"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-common-rg-01|io-p-itn-common-kv-01|owner"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + description                      = "Allows Admin AD Groups to manage the Key Vault"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d38daf6e-4e65-46d2-a11a-6e016b29fcbc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-common-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_itn.module.iam_kv_devs["300ea154-9984-4712-85e9-3abcb3e42960"].module.key_vault.azurerm_role_assignment.certificates["io-p-itn-common-rg-01|io-p-itn-common-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "certificates" {
      + description                      = "Allows Devs AD Groups to manage the Key Vault"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "300ea154-9984-4712-85e9-3abcb3e42960"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Certificate User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-common-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_itn.module.iam_kv_devs["300ea154-9984-4712-85e9-3abcb3e42960"].module.key_vault.azurerm_role_assignment.keys["io-p-itn-common-rg-01|io-p-itn-common-kv-01|writer"] will be created
  + resource "azurerm_role_assignment" "keys" {
      + description                      = "Allows Devs AD Groups to manage the Key Vault"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "300ea154-9984-4712-85e9-3abcb3e42960"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Crypto Officer"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-common-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_itn.module.iam_kv_devs["300ea154-9984-4712-85e9-3abcb3e42960"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-common-rg-01|io-p-itn-common-kv-01|writer"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + description                      = "Allows Devs AD Groups to manage the Key Vault"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "300ea154-9984-4712-85e9-3abcb3e42960"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-common-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_itn.module.iam_kv_devs["7b78851b-c40d-497d-ae7f-596b8f92ecf2"].module.key_vault.azurerm_role_assignment.certificates["io-p-itn-common-rg-01|io-p-itn-common-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "certificates" {
      + description                      = "Allows Devs AD Groups to manage the Key Vault"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7b78851b-c40d-497d-ae7f-596b8f92ecf2"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Certificate User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-common-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_itn.module.iam_kv_devs["7b78851b-c40d-497d-ae7f-596b8f92ecf2"].module.key_vault.azurerm_role_assignment.keys["io-p-itn-common-rg-01|io-p-itn-common-kv-01|writer"] will be created
  + resource "azurerm_role_assignment" "keys" {
      + description                      = "Allows Devs AD Groups to manage the Key Vault"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7b78851b-c40d-497d-ae7f-596b8f92ecf2"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Crypto Officer"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-common-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_itn.module.iam_kv_devs["7b78851b-c40d-497d-ae7f-596b8f92ecf2"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-common-rg-01|io-p-itn-common-kv-01|writer"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + description                      = "Allows Devs AD Groups to manage the Key Vault"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7b78851b-c40d-497d-ae7f-596b8f92ecf2"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-common-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_itn.module.iam_kv_devs["b2ca23d9-ace5-416d-8132-01d9b002db12"].module.key_vault.azurerm_role_assignment.certificates["io-p-itn-common-rg-01|io-p-itn-common-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "certificates" {
      + description                      = "Allows Devs AD Groups to manage the Key Vault"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b2ca23d9-ace5-416d-8132-01d9b002db12"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Certificate User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-common-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_itn.module.iam_kv_devs["b2ca23d9-ace5-416d-8132-01d9b002db12"].module.key_vault.azurerm_role_assignment.keys["io-p-itn-common-rg-01|io-p-itn-common-kv-01|writer"] will be created
  + resource "azurerm_role_assignment" "keys" {
      + description                      = "Allows Devs AD Groups to manage the Key Vault"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b2ca23d9-ace5-416d-8132-01d9b002db12"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Crypto Officer"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-common-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_itn.module.iam_kv_devs["b2ca23d9-ace5-416d-8132-01d9b002db12"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-common-rg-01|io-p-itn-common-kv-01|writer"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + description                      = "Allows Devs AD Groups to manage the Key Vault"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b2ca23d9-ace5-416d-8132-01d9b002db12"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-common-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 23 to add, 1 to change, 0 to destroy.
```

</details>
